EWSEditor/EwsPostExamples/DisableApp.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013" />
    <t:MailboxCulture>en-US</t:MailboxCulture>
    <t:TimeZoneContext>
      <t:TimeZoneDefinition Id="GMT Standard Time"/>
    </t:TimeZoneContext>
  </soap:Header>
  <soap:Body >
    <m:DisableApp>
      <m:ID>1C50226D-04B5-4AB2-9FCD-42E236B59E4B</m:ID>
      <m:DisableReason>NoReason</m:DisableReason>
    </m:DisableApp>
  </soap:Body>
</soap:Envelope>